posts/reading/programming-in-scala.org
#+BEGIN_COMMENT
.. title: Programming in scala
.. slug: programming-in-scala
.. date: 2017-07-15
.. tags: scala
.. category: Books
.. link:
.. description:
.. type: text
#+END_COMMENT



