posts/reading/programming-in-scala.org
* Function

- Define function:
  #+BEGIN_SRC scala
  def max(x: Int, y: Int): Int = {
     if (x>y) x
     else y
  }
  #+END_SRC
- If a function consists of just one statement, the curly braces can
  be omitted.
  #+BEGIN_SRC scala
  def max2(x: Int, y: Int) = if (x>y) x else y
  #+END_SRC
- Scala's Unit type is similar to Java's void type.
- Functions are first class constructs; for example:
  #+BEGIN_SRC scala
  args.foreach(arg => println(arg))
  #+END_SRC
  In this case, a function literal that take one parameter named ~arg~
  is passed in; the body of the function is ~println(arg)~.
- In the above example, Scala infers the type of arg to be String,
  since String is the element type of the array on which you are
  calling foreach. but you can also do more explicitly:
  #+BEGIN_SRC scala
  args.foreach((arg: String) => println(arg))
  #+END_SRC
- If a function literal consists of one statement that takes a single
  argument, you dont need to explicitly name and specify the argument. Thus
  the following code also works:
  #+BEGIN_SRC scala
  args.foreach(println)
  #+END_SRC
- The traditional for loop can be written as like:
  #+BEGIN_SRC scala
  for (arg <- args) println(arg)
  #+END_SRC
  the arg to the left of <- is a val, not a var: arg can't be
  reassigned inside the body of the for expression.
- The generic in scala:
  #+BEGIN_SRC scala
  val greetingStrings = new Array[String](3)
  #+END_SRC
  and to access the array content using parentheses, not square
  brackets as in Java:
  #+BEGIN_SRC scala
  greetStrings(0) = "Hello"
  #+END_SRC
  The for expression that access the array:
  #+BEGIN_SRC scala
  for (i <- 0 to 2) print(grentStrings(0))
  #+END_SRC
- As a *general rule* in scala:  if a method takes only one parameter,
  you can call it without a dot or a parentheses. In the above example
  the ~to~ in is actually a method that takes one Int argument. thus 0 to
  2 is actually a method call ~(0).to(2)~.
- Note that this syntax only works if you explicitly specify the
  receiver of the method call. You cannot write ~println 10~, but you
  can write ~Console println 10~.
- Scala doesn't technically have operator overloading, because it
  doesn't actually have operators in the traditional sense. Instead,
  characters such as +, -, * and / can be used in method names.
- When you *apply parentheses* surrounding one or more values to a
  variable, Scala will transform the code into an invocation of a
  method named ~apply~ on that variable. So ~greetStrings(i)~ gets
  transformed into ~greetStrings.apply(i)~. Thus accessing an element of
  an array in Scala is /simply a method/ call like any other.
- Similarly, when an assignment is made to a variable to which
  *parentheses and one more arguments* have been applied, the compiler
  will transform that into an invocation of an ~update~ method. Thus 
  ~greetString(0) = 1~ is transformed into: ~greetStrings.update(0, 1)~
- To create and initialise arrays more easily:
  #+BEGIN_SRC scala
  val numNames = Array("zero", "one", "two")
  #+END_SRC
  In this case, Scala will actually call a *factory method*, named
  ~apply~, on Array type.
- Scala's array is a *mutable* sequence of objects that all share the
  same type. Array[String] contains only strings; Although you can't
  change the length of an array, you can change its element values. 
- For an immutable sequence of objects that share the same type, you
  can use Scala's List class. ~scala.List~, differs from Java's
  java.util.List type in that Scala Lists are always *immutable*, in a
  sense that, when you call a method on a list that might seem by its
  name to imply the list will mutate, _it instead creates and returns a
  new list with the new value_.
- If a method is used in operator notation, such as ~a*b~, the method is
  invoked on the left operand, as in ~a.*(b)~, unless the method name
  ends in a *colon*, where the method is invoked on the right operand.
- Scala's List can contains only same type elements, while *tuple* can
  contains different types. To instantiate a new tuple that holds some
  objects:
  #+BEGIN_SRC scala
  val pair = (99, "Lu")
  println(pair._1)
  #+END_SRC
  Scala infers the type of the tuple to be Tuple2[Int, String] and
  gives that type to variable pair. Note that these -N numbers
  function to /access the element of a tuple/ is *1* based,  instead of
  zero-based.
- When dealing with map:
  #+BEGIN_SRC scala
  val treasureMap = Map[Int, String] ()
  treasuremap +=  (1 -> "Go to island.")
  #+END_SRC
  the method ~->~ can be applied on any object in scala, which will
  produce a *two element tuple*.
- Both ~set~ and ~map~ in Scala have mutable version and immutable
  version, which resides in different package. When no import is used,
  Scala will choose to use the immutable version.
- One telltale sign is that if code contains any vars, it is probably
  in an imperative style. Thus one way to move towards a functional
  style, is to try to program without vars. The reason Scala
  encourages a functional style, in fact, is that the functional style
  can help you write more understandable, less error-prone
- Another telltale sign of a function with side effects is that its
  result type is Unit.
- One important characteristic of method parameters in Scala is that
  they are vals, not vars. so you cannot reassign a parameter inside a
  method in Scala.
- The recommended style for methods is to avoid having explicit, and
  especially multiple, return statement. Instead, think of _each method
  as an expression that yields one value, which is returned_. This
  philosophy will encourage you to *make methods quite small*, to factor
  large methods into multiple smaller ones.
- Methods with a result type of ~Unit~, are executed for their side
  affects. Another way to express such methods is to leave off the
  result type and the equals sign, and enclose the body of the method
  in curly braces. In this form, the method looks like a
  procedure. For example:
  #+BEGIN_SRC scala
  def add(b: Byte) {sum +=b}
  #+END_SRC
  Whenever you leave off the equals sign before the body of a
  function, its /result type will definitely be ~Unit~/. This is true no
  matter what the body contains, because Scala can/will convert any
  type to Unit.
- Scala includes a special syntax for *raw strings*, which is started
  and ended with three double quotation marks in a row. Inside a raw
  string, | (pipe) at the front of each line and then a method
  stripMargin can be called to remove the white space.
- Whenever you call a method that takes multiple arguments using
  operator notation, you have to place those arguments in
  parentheses. For example:
  #+BEGIN_SRC scala
  s indexOf ('o', 5)
  #+END_SRC
- *Prefix operators* are a shorthand way of invoking methods. In this
  case, the name of the method has *unary_* pretended to the operator
  character. For example, ~-2.0~ will be translated to
  ~(2.0).unary_-~. The /only identifiers/ that can be used as prefix
  operators are *+, -, ! and ~*.
- *Postfix operators* are methods take no arguments, when they are
  _invoked without a dot or parentheses_.
- In scala, you can also leave off empty parentheses on method
  calls. The /convention/ is that you _include parentheses if the mouthed
  has side effects_, such as ~println()~, but you can _leave them off if
  the method has no side effects_, such as ~toLowerCase~ invoked on a
  String.
- Any method that ends in a ":" character is invoked on its right
  operand, passing in the left operand. 

