posts/reading/programming-in-scala/index.html


Define function:
  def max(x: Int, y: Int): Int = {
     if (x&gt;y) x
     else y
  }


If a function consists of just one">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-15T00:00:00+01:00">
<meta property="article:tag" content="scala">
</head>
<body>
    <a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>
    <!-- Target for toggling the sidebar `.sidebar-checkbox` is for regular
            styles, `#sidebar-checkbox` for behavior. -->
    <input type="checkbox" class="sidebar-checkbox" id="sidebar-checkbox"><!-- Toggleable sidebar --><div class="sidebar" id="sidebar">
        <div class="sidebar-item">
            <p>A reserved <a href="https://getnikola.com" target="_blank">Nikola</a> theme that places the utmost gravity on content with a hidden drawer. Made by <a href="https://twitter.com/mdo" target="_blank">@mdo</a> for Jekyll,
            ported to Nikola by <a href="https://twitter.com/ralsina" target="_blank">@ralsina</a>.</p>
        </div>
        
    <nav id="menu" role="navigation" class="sidebar-nav"><a class="sidebar-nav-item" href="../../../archive.html">Archive</a>
        <a class="sidebar-nav-item" href="../../../categories/">Tags</a>
        <a class="sidebar-nav-item" href="../../../rss.xml">RSS feed</a>
    
    
    </nav>
</div>

    <!-- Wrap is the content to shift when toggling the sidebar. We wrap the
         content to avoid any CSS collisions with our real content. -->
    <div class="wrap">
      <div class="masthead">
        <div class="container">
          
    <h3 id="brand" class="masthead-title">
      <a href="https://wudong.graceliu.uk/" title="Warren Liu" rel="home">Warren Liu</a>
    </h3>

        </div>
      </div>

      <div class="container content" id="content">
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="post-title p-name entry-title" itemprop="headline name"><a href="." class="u-url">Programming in scala</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn">Warren Liu</span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="post-date published dt-published" datetime="2017-07-15T00:00:00+01:00" itemprop="datePublished" title="2017-07-15 00:00">2017-07-15 00:00</time></a></p>
        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Function</a></li>
<li><a href="#sec-2">Class and Trait</a></li>
<li><a href="#sec-3">Pattern Matching</a></li>
</ul>
</div>
</div>



<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Function</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Define function:
<div class="highlight"><pre><span></span>  <span class="k">def</span> <span class="n">max</span><span class="o">(</span><span class="n">x</span><span class="k">:</span> <span class="kt">Int</span><span class="o">,</span> <span class="n">y</span><span class="k">:</span> <span class="kt">Int</span><span class="o">)</span><span class="k">:</span> <span class="kt">Int</span> <span class="o">=</span> <span class="o">{</span>
     <span class="k">if</span> <span class="o">(</span><span class="n">x</span><span class="o">&gt;</span><span class="n">y</span><span class="o">)</span> <span class="n">x</span>
     <span class="k">else</span> <span class="n">y</span>
  <span class="o">}</span>
</pre></div>
</li>
<li>If a function consists of just one statement, the curly braces can
be omitted.
<div class="highlight"><pre><span></span><span class="k">def</span> <span class="n">max2</span><span class="o">(</span><span class="n">x</span><span class="k">:</span> <span class="kt">Int</span><span class="o">,</span> <span class="n">y</span><span class="k">:</span> <span class="kt">Int</span><span class="o">)</span> <span class="k">=</span> <span class="k">if</span> <span class="o">(</span><span class="n">x</span><span class="o">&gt;</span><span class="n">y</span><span class="o">)</span> <span class="n">x</span> <span class="k">else</span> <span class="n">y</span>
</pre></div>
</li>
<li>Scala's Unit type is similar to Java's void type.
</li>
<li>Functions are first class constructs; for example:
<div class="highlight"><pre><span></span><span class="n">args</span><span class="o">.</span><span class="n">foreach</span><span class="o">(</span><span class="n">arg</span> <span class="k">=&gt;</span> <span class="n">println</span><span class="o">(</span><span class="n">arg</span><span class="o">))</span>
</pre></div>
<p>
In this case, a function literal that take one parameter named <code>arg</code>
is passed in; the body of the function is <code>println(arg)</code>.
</p>
</li>
<li>In the above example, Scala infers the type of arg to be String,
since String is the element type of the array on which you are
calling foreach. but you can also do more explicitly:
<div class="highlight"><pre><span></span><span class="n">args</span><span class="o">.</span><span class="n">foreach</span><span class="o">((</span><span class="n">arg</span><span class="k">:</span> <span class="kt">String</span><span class="o">)</span> <span class="k">=&gt;</span> <span class="n">println</span><span class="o">(</span><span class="n">arg</span><span class="o">))</span>
</pre></div>
</li>
<li>If a function literal consists of one statement that takes a single
argument, you dont need to explicitly name and specify the argument. Thus
the following code also works:
<div class="highlight"><pre><span></span><span class="n">args</span><span class="o">.</span><span class="n">foreach</span><span class="o">(</span><span class="n">println</span><span class="o">)</span>
</pre></div>
</li>
<li>The traditional for loop can be written as like:
<div class="highlight"><pre><span></span><span class="k">for</span> <span class="o">(</span><span class="n">arg</span> <span class="k">&lt;-</span> <span class="n">args</span><span class="o">)</span> <span class="n">println</span><span class="o">(</span><span class="n">arg</span><span class="o">)</span>
</pre></div>
<p>
the arg to the left of &lt;- is a val, not a var: arg can't be
reassigned inside the body of the for expression.
</p>
</li>
<li>The generic in scala:
<div class="highlight"><pre><span></span><span class="k">val</span> <span class="n">greetingStrings</span> <span class="k">=</span> <span class="k">new</span> <span class="nc">Array</span><span class="o">[</span><span class="kt">String</span><span class="o">](</span><span class="mi">3</span><span class="o">)</span>
</pre></div>
<p>
and to access the array content using parentheses, not square
brackets as in Java:
</p>
<div class="highlight"><pre><span></span><span class="n">greetStrings</span><span class="o">(</span><span class="mi">0</span><span class="o">)</span> <span class="k">=</span> <span class="s">"Hello"</span>
</pre></div>
<p>
The for expression that access the array:
</p>
<div class="highlight"><pre><span></span><span class="k">for</span> <span class="o">(</span><span class="n">i</span> <span class="k">&lt;-</span> <span class="mi">0</span> <span class="n">to</span> <span class="mi">2</span><span class="o">)</span> <span class="n">print</span><span class="o">(</span><span class="n">grentStrings</span><span class="o">(</span><span class="mi">0</span><span class="o">))</span>
</pre></div>
</li>
<li>As a <b>general rule</b> in scala:  if a method takes only one parameter,
you can call it without a dot or a parentheses. In the above example
the <code>to</code> in is actually a method that takes one Int argument. thus 0 to
2 is actually a method call <code>(0).to(2)</code>.
</li>
<li>Note that this syntax only works if you explicitly specify the
receiver of the method call. You cannot write <code>println 10</code>, but you
can write <code>Console println 10</code>.
</li>
<li>Scala doesn't technically have operator overloading, because it
doesn't actually have operators in the traditional sense. Instead,
characters such as +, -, * and / can be used in method names.
</li>
<li>When you <b>apply parentheses</b> surrounding one or more values to a
variable, Scala will transform the code into an invocation of a
method named <code>apply</code> on that variable. So <code>greetStrings(i)</code> gets
transformed into <code>greetStrings.apply(i)</code>. Thus accessing an element of
an array in Scala is <i>simply a method</i> call like any other.
</li>
<li>Similarly, when an assignment is made to a variable to which
<b>parentheses and one more arguments</b> have been applied, the compiler
will transform that into an invocation of an <code>update</code> method. Thus 
<code>greetString(0) = 1</code> is transformed into: <code>greetStrings.update(0, 1)</code>
</li>
<li>To create and initialise arrays more easily:
<div class="highlight"><pre><span></span><span class="k">val</span> <span class="n">numNames</span> <span class="k">=</span> <span class="nc">Array</span><span class="o">(</span><span class="s">"zero"</span><span class="o">,</span> <span class="s">"one"</span><span class="o">,</span> <span class="s">"two"</span><span class="o">)</span>
</pre></div>
<p>
In this case, Scala will actually call a <b>factory method</b>, named
<code>apply</code>, on Array type.
</p>
</li>
<li>Scala's array is a <b>mutable</b> sequence of objects that all share the
same type. Array[String] contains only strings; Although you can't
change the length of an array, you can change its element values. 
</li>
<li>For an immutable sequence of objects that share the same type, you
can use Scala's List class. <code>scala.List</code>, differs from Java's
java.util.List type in that Scala Lists are always <b>immutable</b>, in a
sense that, when you call a method on a list that might seem by its
name to imply the list will mutate, <span class="underline">it instead creates and returns a
new list with the new value</span>.
</li>
<li>If a method is used in operator notation, such as <code>a*b</code>, the method is
invoked on the left operand, as in <code>a.*(b)</code>, unless the method name
ends in a <b>colon</b>, where the method is invoked on the right operand.
</li>
<li>Scala's List can contains only same type elements, while <b>tuple</b> can
contains different types. To instantiate a new tuple that holds some
objects:
<div class="highlight"><pre><span></span><span class="k">val</span> <span class="n">pair</span> <span class="k">=</span> <span class="o">(</span><span class="mi">99</span><span class="o">,</span> <span class="s">"Lu"</span><span class="o">)</span>
<span class="n">println</span><span class="o">(</span><span class="n">pair</span><span class="o">.</span><span class="n">_1</span><span class="o">)</span>
</pre></div>
<p>
Scala infers the type of the tuple to be Tuple2[Int, String] and
gives that type to variable pair. Note that these -N numbers
function to <i>access the element of a tuple</i> is <b>1</b> based,  instead of
zero-based.
</p>
</li>
<li>When dealing with map:
<div class="highlight"><pre><span></span><span class="k">val</span> <span class="n">treasureMap</span> <span class="k">=</span> <span class="nc">Map</span><span class="o">[</span><span class="kt">Int</span>, <span class="kt">String</span><span class="o">]</span> <span class="o">()</span>
<span class="n">treasuremap</span> <span class="o">+=</span>  <span class="o">(</span><span class="mi">1</span> <span class="o">-&gt;</span> <span class="s">"Go to island."</span><span class="o">)</span>
</pre></div>
<p>
the method ~-&gt;~ can be applied on any object in scala, which will
produce a <b>two element tuple</b>.
</p>
</li>
<li>Both <code>set</code> and <code>map</code> in Scala have mutable version and immutable
version, which resides in different package. When no import is used,
Scala will choose to use the immutable version.
</li>
<li>One telltale sign is that if code contains any vars, it is probably
in an imperative style. Thus one way to move towards a functional
style, is to try to program without vars. The reason Scala
encourages a functional style, in fact, is that the functional style
can help you write more understandable, less error-prone
</li>
<li>Another telltale sign of a function with side effects is that its
result type is Unit.
</li>
<li>One important characteristic of method parameters in Scala is that
they are vals, not vars. so you cannot reassign a parameter inside a
method in Scala.
</li>
<li>The recommended style for methods is to avoid having explicit, and
especially multiple, return statement. Instead, think of <span class="underline">each method
as an expression that yields one value, which is returned</span>. This
philosophy will encourage you to <b>make methods quite small</b>, to factor
large methods into multiple smaller ones.
</li>
<li>Methods with a result type of <code>Unit</code>, are executed for their side
affects. Another way to express such methods is to leave off the
result type and the equals sign, and enclose the body of the method
in curly braces. In this form, the method looks like a
procedure. For example:
<div class="highlight"><pre><span></span><span class="k">def</span> <span class="n">add</span><span class="o">(</span><span class="n">b</span><span class="k">:</span> <span class="kt">Byte</span><span class="o">)</span> <span class="o">{</span><span class="n">sum</span> <span class="o">+=</span><span class="n">b</span><span class="o">}</span>
</pre></div>
<p>
Whenever you leave off the equals sign before the body of a
function, its <i>result type will definitely be <code>Unit</code></i>. This is true no
matter what the body contains, because Scala can/will convert any
type to Unit.
</p>
</li>
<li>Scala includes a special syntax for <b>raw strings</b>, which is started
and ended with three double quotation marks in a row. Inside a raw
string, | (pipe) at the front of each line and then a method
stripMargin can be called to remove the white space.
</li>
<li>Whenever you call a method that takes multiple arguments using
operator notation, you have to place those arguments in
parentheses. For example:
<div class="highlight"><pre><span></span><span class="n">s</span> <span class="n">indexOf</span> <span class="o">(</span><span class="sc">'o'</span><span class="o">,</span> <span class="mi">5</span><span class="o">)</span>
</pre></div>
</li>
<li>
<b>Prefix operators</b> are a shorthand way of invoking methods. In this
case, the name of the method has <b>unary_</b> pretended to the operator
character. For example, <code>-2.0</code> will be translated to
<code>(2.0).unary_-</code>. The <i>only identifiers</i> that can be used as prefix
operators are <b>+, -, ! and ~</b>.
</li>
<li>
<b>Postfix operators</b> are methods take no arguments, when they are
<span class="underline">invoked without a dot or parentheses</span>.
</li>
<li>In scala, you can also leave off empty parentheses on method
calls. The <i>convention</i> is that you <span class="underline">include parentheses if the mouthed
has side effects</span>, such as <code>println()</code>, but you can <span class="underline">leave them off if
the method has no side effects</span>, such as <code>toLowerCase</code> invoked on a
String.
</li>
<li>Any method that ends in a ":" character is invoked on its right
operand, passing in the left operand. 
</li>
</ul>
</div>
</div>
