posts/reading/programming-in-scala.org
* Class and Trait
- *Object equality* is compared with ~==~ or ~!=~. To comparing *reference
  equality*, use method ~eq~ and ~ne~. However, eq and ne only apply to
  objects that directly map to Java objects.
- When a *singleton* object shares the same name with a class, it is
  called that class's /companion object/; and you must define both the
  class and its companion object /in the same source file/. _A class and
  its companion object can assess each other's private members_.
- Ond difference between classes and singleton objects is that
  singleton objects cannot take parameters, cause you can't
  instantiate a single object with the new keyword. 
- Each singleton object is implemented as an instance of a synthetic
  class referenced from a static variable, so they have the same
  initialisation semantics as java statics. In particular, a singleton
  object is initialised the first time some code access it. 
- Scala implicitly imports members of packages ~java.lang~ and ~scala~, as
  well as the member of a singleton object named *~Predef~*.
- If a class doesn't have a body, u don't need to specify empty curly
  braces. The identifiers in the parentheses after the class name are
  called *class parameters*. Scala compiler will gather up these
  class parameters and create a *primary constructor* that takes the
  same two parameters. For example:
  #+BEGIN_SRC scala
  class Rational(n: Int, d: Int)
  #+END_SRC
  class parameters can be used directly in the body of the class.
- The scala compiler will compile any code you place in the class
  body, _which isn't part of a field or a method definition_, into the
  *primary constructor*.
- To override a method:
  #+BEGIN_SRC scala
  override def toString = n +"/" _d
  #+END_SRC
- Check preconditions, using ~require~:
  #+BEGIN_SRC scala
  require (d!=0)
  #+END_SRC
  ~IllegalArgumentException~ will be raised when the condition fail.
- Class parameters can only be access by ~this~ object.
- In scala, constructors other than the primary constructor are called
  *auxiliary constructors*, and it is defined like: 
  #+BEGIN_SRC scala
  def this(n: Int)  = this(n, 1) 
  #+END_SRC
- Scala can do implicit conversion of type by:
  #+BEGIN_SRC scala
  implicit def intToRational(x: Int) = new Rational(x)
  #+END_SRC
  Note that for an implicit conversion to work, it needs to be in
  scape. if the implicit method definition inside class Rational, it
  won't be in scope in the interpreter.
- Scala's control structures are ~if~, ~while~, ~for~, ~try~, ~match~ and
  ~function calls~. /Almost all Scala's control structures result in some
  value/. 
- The ~while~ and ~do-while~ constructs are called "loops", not
  expressions, because /they don't result in an interesting value/. The
  type of result is *Unit*. Only one value exists for type Unit, it is
  called unit value and is written *()*. /The exists of () is how Scala's
  Unit different from Java's void/. 
- While in Java, /assignment results in the value assigned/, in Scala
  *assignment always results in unit value ()*. Thus for example this
  bit of code won't work:
  #+BEGIN_SRC scala
  while ((line = readLine()) !="") println (line)
  #+END_SRC
  It will cause infinite loop; cause any thing compared with a () will
  result in true.
- for expression with a filter:
  #+BEGIN_SRC scala
  for (file <- filesHere if file.getName.endsWith(".scala")) println(file)
  #+END_SRC
  more than one filters can be includes. 
- for expression can have more than one <- to get nested "loops". 
  #+BEGIN_SRC scala
  for (file <- filesHere if file.getName.endsWith(".scala");
      line<-fileLines(file) if line.trim.matches(pattern)) ..
  #+END_SRC
- Mid-stream variable bindings in for expression:
  #+BEGIN_SRC scala
  for {
   file<-filesHere if file.getName.endsWith(".scala")
   line<-fileLInes(file)
   trimmed = line.trim if trimmed.matches(pattern)
  }...
  #+END_SRC
- ~for .. yield...~ to produce new collections. 
  #+BEGIN_SRC scala
  for {
   file<- filesHere if file.getName.endsWith(".scala")
  } yield file
  #+END_SRC
  the type of resulting collection is based on the kind of collection processed.
- In scala, /throw is an expression that has a result type of
  *Nothing*/, although when throw happens, the result type is never
  evaluated.
- As with most Scala control structures, ~try-catch-finally~ results in
  a value. If an exception is thrown but not caught, the expression
  has not result al all; /The value computed in the finally clause, if
  there is one, is dropped/. Usually finally clauses do some kind of
  clean up; they should not normally change the value computers in the
  main body or a catch cause. 
- ~match~ expression also result in a value. 
- Scala don't have break and continue.
- A ~function literal~ is compiled into a class that when instantiated
  at runtime is a function value. Function literals exists in the
  source code where function values exist as objects at runtime. 
- To make a ~function literal~ even more concise, you can use
  /underscores as placeholders/ for one or *more* parameters, so long as
  _each parameter appears only one time within the function_
  literal. for example: ~ _ > 0~ is same as ~x => x>0~
- If the compiler cannot know enough of the type of the parameter when
  placeholder is used, the type can be specified: 
  #+BEGIN_SRC scala
  val f= (_: Int) +(_: Int)
  #+END_SRC
- Multiple underscores means /multiple parameters/.
- You can also replace an entire parameter list with an underscore.
- The function value (the object) that's created at runtime from this
  function literal is called a ~closure~. The name arises from the act
  of "closing" the function literal by "capturing" the hidings of its
  free variables. A function literal with no free variables is called
  a closed term; and any function literal with free variables, such as
  (x: Int) => x + more,  is an open term. 
- What happens if the free variables are changed after the closure is
  created? In Scala, the answer is that closure sees the
  change. Change made by the closure to a captured variable are
  visible outside the closure.
- Scala allows you to indicate that the last parameter to a function
  may be repeated. This allow clients to pass variable length argument
  lists to the function.
  #+BEGIN_SRC scala
  def echo(args: String*) = for (arg <- args) println(arg)
  #+END_SRC
- The type of args inside the echo function String* is actually
  Array[String]. /However you cannot pass a Array[String] into that
  function directly/. To accomplish this, you will need to append the
  array argument with an colon and an _* symbol, like:
  #+BEGIN_SRC scala
  val array = Array("A", "B")
  echo(array: _*)
  #+END_SRC
  This notation tells the compiler to pass each element of array as
  its own argument to echo, rather than all of it as a single
  argument. 
- You can use Named arguments to change the order the parameter is
  passed into a function:
  #+BEGIN_SRC scala
  def speed(distance: Float, time: Float) : Float = distance / time
  speed(time=10, distance=100)
  #+END_SRC
- You can also define default parameter values for function
  parameters. The argument for such a parameter can optionally be
  omitted from a function call, in which case the corresponding
  argument will be filled with the default.
- In any method invocation in Scala in which you are passing in
  exactly one argument, you can opt to /use curly braces to surround
  the argument instead of parentheses/. This enable client programmers
  to _write function literals between curly braces_. 
- In scala, *by-name parameter* to *delay the function call* when
  passing function value; the function value is not evaluated at the
  point of function application, but instead is /evaluated at each use
  within the function/.
- *Case classes* are regular classes which export their constructor
  parameters and which provide a recursive decomposition mechanism
  via pattern matching. It makes only sense to /define case classes if
  *pattern matching* is used to decompose data structures/. 
- Scala does not require that the new primitive is used to
  facilitate the construction of case classes.
- Similar to  interfaces  in Java, traits are used to define object
  types by specifying the signature of the supported methods. Unlike
  Java, Scala allows traits to be partially implemented; i.e. it is
  possible to define default implementations for some methods. In
  contrast to  classes, traits may not have /constructor parameters/.
- Scala is very liberal when it comes to mixing *parameterless*
  and *empty-paren* methods.
  - In particular, you can override a
    parameterless method with an empty-paren method, and vice versa.
  - you can also leave off the empty parentheses on an invocation of
    any function that takes no arguments. 
- In Scala, any class will implicitly extends from scala.AnyRef, which
  is same as class java.lang.Object.
- Filed can be used to override an *parameterless* method. But on the
  other hand, it is /forbidden to define a field and method with the
  same name in the same class, whereas it is allowed in Java/. 
- A parametric filed for class:
  #+BEGIN_SRC scala
  class ArrayElement (
     val contents: Array[String]
  ) extends Element
  #+END_SRC
  - combine  the  definition  of a class parameter and a
    field.
  - You can also prefix a class parameter with ~var~, in which case
    the corresponding field would be reassignable.
  - It is possible to add modifiers such as ~private~, ~protected~, or
    ~override~ to these parametric fields, just as you can do for any
    other class member.
- Invoking superclass constructors:
  #+BEGIN_SRC scala
  class LineElement(s: String) extends ArrayElement(Array(s)){
  }
  #+END_SRC
- For override modifier, Scala requires such a modifier for all
   members that override a concrete member in a parent
  class. the modifier is optional if a member implements an
  abstract member with the same name. The modifier is forbidden if a
  member doesn't not override or implement some other member in a base
  class.
- Traits let you modify the methods of a class, and they do so in a
  way that allow you to stack those modifications with each other. 
- *Stackable modification* of traits:
  #+BEGIN_SRC scala
  trait Doubling extends IntQueue {
     abstract override def put(x: Int) {super.put(2*x) }
  }
  #+END_SRC
  - ~super()~ calls in traits are dynamically bound. it will work as
    long as the traits is mixed in after another trait or class that
    gives a concrete definition to the method.
  - To tell the compiler you are doing this on purpose, you must mark
    such methods as abstract override. This combination of modifiers
    is only allowed for members of traits, not classes. 
- When you call a method on a class with several  mixed-in traits, the
  method in the *right furthest* traits will be called. If it has a
  ~super()~ call, the left  to  it will be called, and so on. The
  /order of mixed-in traits is important/.
- Scala compiler adds a *copy* method to a case class for making
  copied instance that are same except one or two attributes are
  different. The method works by using named and default parameters:
  ~op.copy(operator = "-")~

