posts/reading/programming-in-scala/index.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Class and Trait</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>
<b>Object equality</b> is compared with <code>==</code> or <code>!=</code>. To comparing <b>reference
equality</b>, use method <code>eq</code> and <code>ne</code>. However, eq and ne only apply to
objects that directly map to Java objects.
</li>
<li>When a <b>singleton</b> object shares the same name with a class, it is
called that class's <i>companion object</i>; and you must define both the
class and its companion object <i>in the same source file</i>. <span class="underline">A class and
its companion object can assess each other's private members</span>.
</li>
<li>Ond difference between classes and singleton objects is that
singleton objects cannot take parameters, cause you can't
instantiate a single object with the new keyword. 
</li>
<li>Each singleton object is implemented as an instance of a synthetic
class referenced from a static variable, so they have the same
initialisation semantics as java statics. In particular, a singleton
object is initialised the first time some code access it. 
</li>
<li>Scala implicitly imports members of packages <code>java.lang</code> and <code>scala</code>, as
well as the member of a singleton object named <b><code>Predef</code></b>.
</li>
<li>If a class doesn't have a body, u don't need to specify empty curly
braces. The identifiers in the parentheses after the class name are
called <b>class parameters</b>. Scala compiler will gather up these
class parameters and create a <b>primary constructor</b> that takes the
same two parameters. For example:
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">Rational</span><span class="o">(</span><span class="n">n</span><span class="k">:</span> <span class="kt">Int</span><span class="o">,</span> <span class="n">d</span><span class="k">:</span> <span class="kt">Int</span><span class="o">)</span>
</pre></div>
<p>
class parameters can be used directly in the body of the class.
</p>
</li>
<li>The scala compiler will compile any code you place in the class
body, <span class="underline">which isn't part of a field or a method definition</span>, into the
<b>primary constructor</b>.
</li>
<li>To override a method:
<div class="highlight"><pre><span></span><span class="k">override</span> <span class="k">def</span> <span class="n">toString</span> <span class="k">=</span> <span class="n">n</span> <span class="o">+</span><span class="s">"/"</span> <span class="nc">_d</span>
</pre></div>
</li>
<li>Check preconditions, using <code>require</code>:
<div class="highlight"><pre><span></span><span class="n">require</span> <span class="o">(</span><span class="n">d</span><span class="o">!=</span><span class="mi">0</span><span class="o">)</span>
</pre></div>
<p>
<code>IllegalArgumentException</code> will be raised when the condition fail.
</p>
</li>
<li>Class parameters can only be access by <code>this</code> object.
</li>
<li>In scala, constructors other than the primary constructor are called
<b>auxiliary constructors</b>, and it is defined like: 
<div class="highlight"><pre><span></span><span class="k">def</span> <span class="k">this</span><span class="o">(</span><span class="n">n</span><span class="k">:</span> <span class="kt">Int</span><span class="o">)</span>  <span class="k">=</span> <span class="k">this</span><span class="o">(</span><span class="n">n</span><span class="o">,</span> <span class="mi">1</span><span class="o">)</span> 
</pre></div>
</li>
<li>Scala can do implicit conversion of type by:
<div class="highlight"><pre><span></span><span class="k">implicit</span> <span class="k">def</span> <span class="n">intToRational</span><span class="o">(</span><span class="n">x</span><span class="k">:</span> <span class="kt">Int</span><span class="o">)</span> <span class="k">=</span> <span class="k">new</span> <span class="nc">Rational</span><span class="o">(</span><span class="n">x</span><span class="o">)</span>
</pre></div>
<p>
Note that for an implicit conversion to work, it needs to be in
scape. if the implicit method definition inside class Rational, it
won't be in scope in the interpreter.
</p>
</li>
<li>Scala's control structures are <code>if</code>, <code>while</code>, <code>for</code>, <code>try</code>, <code>match</code> and
<code>function calls</code>. /Almost all Scala's control structures result in some
value/. 
</li>
<li>The <code>while</code> and <code>do-while</code> constructs are called "loops", not
expressions, because <i>they don't result in an interesting value</i>. The
type of result is <b>Unit</b>. Only one value exists for type Unit, it is
called unit value and is written <b>()</b>. <i>The exists of () is how Scala's
Unit different from Java's void</i>. 
</li>
<li>While in Java, <i>assignment results in the value assigned</i>, in Scala
<b>assignment always results in unit value ()</b>. Thus for example this
bit of code won't work:
<div class="highlight"><pre><span></span><span class="k">while</span> <span class="o">((</span><span class="n">line</span> <span class="k">=</span> <span class="n">readLine</span><span class="o">())</span> <span class="o">!=</span><span class="s">""</span><span class="o">)</span> <span class="n">println</span> <span class="o">(</span><span class="n">line</span><span class="o">)</span>
</pre></div>
<p>
It will cause infinite loop; cause any thing compared with a () will
result in true.
</p>
</li>
<li>for expression with a filter:
<div class="highlight"><pre><span></span><span class="k">for</span> <span class="o">(</span><span class="n">file</span> <span class="k">&lt;-</span> <span class="n">filesHere</span> <span class="k">if</span> <span class="n">file</span><span class="o">.</span><span class="n">getName</span><span class="o">.</span><span class="n">endsWith</span><span class="o">(</span><span class="s">".scala"</span><span class="o">))</span> <span class="n">println</span><span class="o">(</span><span class="n">file</span><span class="o">)</span>
</pre></div>
<p>
more than one filters can be includes. 
</p>
</li>
<li>for expression can have more than one &lt;- to get nested "loops". 
<div class="highlight"><pre><span></span><span class="k">for</span> <span class="o">(</span><span class="n">file</span> <span class="k">&lt;-</span> <span class="n">filesHere</span> <span class="k">if</span> <span class="n">file</span><span class="o">.</span><span class="n">getName</span><span class="o">.</span><span class="n">endsWith</span><span class="o">(</span><span class="s">".scala"</span><span class="o">);</span>
    <span class="n">line</span><span class="k">&lt;-</span><span class="n">fileLines</span><span class="o">(</span><span class="n">file</span><span class="o">)</span> <span class="k">if</span> <span class="n">line</span><span class="o">.</span><span class="n">trim</span><span class="o">.</span><span class="n">matches</span><span class="o">(</span><span class="n">pattern</span><span class="o">))</span> <span class="o">..</span>
</pre></div>
</li>
<li>Mid-stream variable bindings in for expression:
<div class="highlight"><pre><span></span><span class="k">for</span> <span class="o">{</span>
 <span class="n">file</span><span class="k">&lt;-</span><span class="n">filesHere</span> <span class="k">if</span> <span class="n">file</span><span class="o">.</span><span class="n">getName</span><span class="o">.</span><span class="n">endsWith</span><span class="o">(</span><span class="s">".scala"</span><span class="o">)</span>
 <span class="n">line</span><span class="k">&lt;-</span><span class="n">fileLInes</span><span class="o">(</span><span class="n">file</span><span class="o">)</span>
 <span class="n">trimmed</span> <span class="k">=</span> <span class="n">line</span><span class="o">.</span><span class="n">trim</span> <span class="k">if</span> <span class="n">trimmed</span><span class="o">.</span><span class="n">matches</span><span class="o">(</span><span class="n">pattern</span><span class="o">)</span>
<span class="o">}...</span>
</pre></div>
</li>
<li>
<code>for .. yield...</code> to produce new collections. 
<div class="highlight"><pre><span></span>  <span class="k">for</span> <span class="o">{</span>
   <span class="n">file</span><span class="k">&lt;-</span> <span class="n">filesHere</span> <span class="k">if</span> <span class="n">file</span><span class="o">.</span><span class="n">getName</span><span class="o">.</span><span class="n">endsWith</span><span class="o">(</span><span class="s">".scala"</span><span class="o">)</span>
  <span class="o">}</span> <span class="k">yield</span> <span class="n">file</span>
</pre></div>
<p>
the type of resulting collection is based on the kind of collection processed.
</p>
</li>
<li>In scala, <i>throw is an expression that has a result type of
<b>Nothing</b></i>, although when throw happens, the result type is never
evaluated.
</li>
<li>As with most Scala control structures, <code>try-catch-finally</code> results in
a value. If an exception is thrown but not caught, the expression
has not result al all; <i>The value computed in the finally clause, if
there is one, is dropped</i>. Usually finally clauses do some kind of
clean up; they should not normally change the value computers in the
main body or a catch cause. 
</li>
<li>
<code>match</code> expression also result in a value. 
</li>
<li>Scala don't have break and continue.
</li>
<li>A <code>function literal</code> is compiled into a class that when instantiated
at runtime is a function value. Function literals exists in the
source code where function values exist as objects at runtime. 
</li>
<li>To make a <code>function literal</code> even more concise, you can use
<i>underscores as placeholders</i> for one or <b>more</b> parameters, so long as
<span class="underline">each parameter appears only one time within the function</span>
literal. for example: ~ _ &gt; 0~ is same as <code>x =&gt; x&gt;0</code>
</li>
<li>If the compiler cannot know enough of the type of the parameter when
placeholder is used, the type can be specified: 
<div class="highlight"><pre><span></span><span class="k">val</span> <span class="n">f</span><span class="k">=</span> <span class="o">(</span><span class="k">_:</span> <span class="kt">Int</span><span class="o">)</span> <span class="o">+(</span><span class="k">_:</span> <span class="kt">Int</span><span class="o">)</span>
</pre></div>
</li>
<li>Multiple underscores means <i>multiple parameters</i>.
</li>
<li>You can also replace an entire parameter list with an underscore.
</li>
<li>The function value (the object) that's created at runtime from this
function literal is called a <code>closure</code>. The name arises from the act
of "closing" the function literal by "capturing" the hidings of its
free variables. A function literal with no free variables is called
a closed term; and any function literal with free variables, such as
(x: Int) =&gt; x + more,  is an open term. 
</li>
<li>What happens if the free variables are changed after the closure is
created? In Scala, the answer is that closure sees the
change. Change made by the closure to a captured variable are
visible outside the closure.
</li>
<li>Scala allows you to indicate that the last parameter to a function
may be repeated. This allow clients to pass variable length argument
lists to the function.
<div class="highlight"><pre><span></span><span class="k">def</span> <span class="n">echo</span><span class="o">(</span><span class="n">args</span><span class="k">:</span> <span class="kt">String*</span><span class="o">)</span> <span class="k">=</span> <span class="k">for</span> <span class="o">(</span><span class="n">arg</span> <span class="k">&lt;-</span> <span class="n">args</span><span class="o">)</span> <span class="n">println</span><span class="o">(</span><span class="n">arg</span><span class="o">)</span>
</pre></div>
</li>
<li>The type of args inside the echo function String* is actually
Array[String]. <i>However you cannot pass a Array[String] into that
function directly</i>. To accomplish this, you will need to append the
array argument with an colon and an _* symbol, like:
<div class="highlight"><pre><span></span><span class="k">val</span> <span class="n">array</span> <span class="k">=</span> <span class="nc">Array</span><span class="o">(</span><span class="s">"A"</span><span class="o">,</span> <span class="s">"B"</span><span class="o">)</span>
<span class="n">echo</span><span class="o">(</span><span class="n">array</span><span class="k">:</span> <span class="k">_</span><span class="kt">*</span><span class="o">)</span>
</pre></div>
<p>
This notation tells the compiler to pass each element of array as
its own argument to echo, rather than all of it as a single
argument. 
</p>
</li>
<li>You can use Named arguments to change the order the parameter is
passed into a function:
<div class="highlight"><pre><span></span><span class="k">def</span> <span class="n">speed</span><span class="o">(</span><span class="n">distance</span><span class="k">:</span> <span class="kt">Float</span><span class="o">,</span> <span class="n">time</span><span class="k">:</span> <span class="kt">Float</span><span class="o">)</span> <span class="k">:</span> <span class="kt">Float</span> <span class="o">=</span> <span class="n">distance</span> <span class="o">/</span> <span class="n">time</span>
<span class="n">speed</span><span class="o">(</span><span class="n">time</span><span class="k">=</span><span class="mi">10</span><span class="o">,</span> <span class="n">distance</span><span class="k">=</span><span class="mi">100</span><span class="o">)</span>
</pre></div>
</li>
<li>You can also define default parameter values for function
parameters. The argument for such a parameter can optionally be
omitted from a function call, in which case the corresponding
argument will be filled with the default.
</li>
<li>In any method invocation in Scala in which you are passing in
exactly one argument, you can opt to <i>use curly braces to surround
the argument instead of parentheses</i>. This enable client programmers
to <span class="underline">write function literals between curly braces</span>. 
</li>
<li>In scala, <b>by-name parameter</b> to <b>delay the function call</b> when
passing function value; the function value is not evaluated at the
point of function application, but instead is <i>evaluated at each use
within the function</i>.
</li>
<li>
<b>Case classes</b> are regular classes which export their constructor
parameters and which provide a recursive decomposition mechanism
via pattern matching. It makes only sense to <i>define case classes if
<b>pattern matching</b> is used to decompose data structures</i>. 
</li>
<li>Scala does not require that the new primitive is used to
facilitate the construction of case classes.
</li>
<li>Similar to  interfaces  in Java, traits are used to define object
types by specifying the signature of the supported methods. Unlike
Java, Scala allows traits to be partially implemented; i.e. it is
possible to define default implementations for some methods. In
contrast to  classes, traits may not have <i>constructor parameters</i>.
</li>
<li>Scala is very liberal when it comes to mixing <b>parameterless</b>
  and <b>empty-paren</b> methods.
<ul class="org-ul">
<li>In particular, you can override a
parameterless method with an empty-paren method, and vice versa.
</li>
<li>you can also leave off the empty parentheses on an invocation of
any function that takes no arguments. 
</li>
</ul>
</li>
<li>In Scala, any class will implicitly extends from scala.AnyRef, which
is same as class java.lang.Object.
</li>
<li>Filed can be used to override an <b>parameterless</b> method. But on the
other hand, it is <i>forbidden to define a field and method with the
same name in the same class, whereas it is allowed in Java</i>. 
</li>
<li>A parametric filed for class:
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">ArrayElement</span> <span class="o">(</span>
   <span class="k">val</span> <span class="n">contents</span><span class="k">:</span> <span class="kt">Array</span><span class="o">[</span><span class="kt">String</span><span class="o">]</span>
<span class="o">)</span> <span class="k">extends</span> <span class="nc">Element</span>
</pre></div>
<ul class="org-ul">
<li>combine  the  definition  of a class parameter and a
field.
</li>
<li>You can also prefix a class parameter with <code>var</code>, in which case
the corresponding field would be reassignable.
</li>
<li>It is possible to add modifiers such as <code>private</code>, <code>protected</code>, or
<code>override</code> to these parametric fields, just as you can do for any
other class member.
</li>
</ul>
</li>
<li>Invoking superclass constructors:
<div class="highlight"><pre><span></span><span class="k">class</span> <span class="nc">LineElement</span><span class="o">(</span><span class="n">s</span><span class="k">:</span> <span class="kt">String</span><span class="o">)</span> <span class="k">extends</span> <span class="nc">ArrayElement</span><span class="o">(</span><span class="nc">Array</span><span class="o">(</span><span class="n">s</span><span class="o">)){</span>
<span class="o">}</span>
</pre></div>
</li>
<li>For override modifier, Scala requires such a modifier for all
 members that override a concrete member in a parent
class. the modifier is optional if a member implements an
abstract member with the same name. The modifier is forbidden if a
member doesn't not override or implement some other member in a base
class.
</li>
<li>Traits let you modify the methods of a class, and they do so in a
way that allow you to stack those modifications with each other. 
</li>
<li>
<b>Stackable modification</b> of traits:
<div class="highlight"><pre><span></span>  <span class="k">trait</span> <span class="nc">Doubling</span> <span class="k">extends</span> <span class="nc">IntQueue</span> <span class="o">{</span>
     <span class="k">abstract</span> <span class="k">override</span> <span class="k">def</span> <span class="n">put</span><span class="o">(</span><span class="n">x</span><span class="k">:</span> <span class="kt">Int</span><span class="o">)</span> <span class="o">{</span><span class="k">super</span><span class="o">.</span><span class="n">put</span><span class="o">(</span><span class="mi">2</span><span class="o">*</span><span class="n">x</span><span class="o">)</span> <span class="o">}</span>
  <span class="o">}</span>
</pre></div>
<ul class="org-ul">
<li>
<code>super()</code> calls in traits are dynamically bound. it will work as
long as the traits is mixed in after another trait or class that
gives a concrete definition to the method.
</li>
<li>To tell the compiler you are doing this on purpose, you must mark
such methods as abstract override. This combination of modifiers
is only allowed for members of traits, not classes. 
</li>
</ul>
</li>
<li>When you call a method on a class with several  mixed-in traits, the
method in the <b>right furthest</b> traits will be called. If it has a
<code>super()</code> call, the left  to  it will be called, and so on. The
<i>order of mixed-in traits is important</i>.
</li>
<li>Scala compiler adds a <b>copy</b> method to a case class for making
copied instance that are same except one or two attributes are
different. The method works by using named and default parameters:
<code>op.copy(operator = "-")</code>
</li>
</ul>
</div>
</div>
