posts/reading/programming-in-scala.org
* Pattern Matching
- Scala's match never "fall through" into the next case. If none of
  the patterns match, an exception named "MatchError" is thrown.
- A constant pattern matches only itself. Any literal can be used as a
  constant.
- Any ~val~ or *singleton object* can be used as a constant. For
  example, ~Nil~, a singleton object, is a pattern that matches only
  empty List.
- A *variable pattern* matches /any object/, just like a *wildcard* but
  Scala bind the variable to whatever the object is. 
- How does Scala compiler know that "Pi" is a constant imported from
  scala.math, and not a variable that stands for the selector value
  itself? Scala uses a s impel  lexical rule for disambiguation:
  - a simple name starting with a lowercase letter is taken to be a
    pattern variable;
  - all other references  are taken to be constants. 
  - Lower case  constant identifier  can be treated in pattern match with
    a back tick syntax. back tick can also be used to treat a keyword as
    an ordinary identifier: \\
    ~Tread.`yield`()~ treats yield as an identifier rather than a
    keyword.
- You can match against sequence type like List or Array just like you
  match against case classes. you can also match against tuples.
- Typed pattern can be used as a convenient replacement for type tests
  and type casts:
  #+BEGIN_SRC scala
  def generalSize(x: Any) = x match {
     case s: String => s.length
     case m: Map[_, _] => m.size
     case _ => -1
  }
  #+END_SRC
- Alternatively: ~expr.isInstanceOf[String]~ and
  ~expr.asInstanceOf[String]~ can be used.
- Scala restricts patterns to be linear: a pattern variable may only
  appear once in a pattern. However you can use *pattern guard*:
  #+BEGIN_SRC scala
  def simplifyAdd(e: Expr) = e match {
     case BinOp("+", x, y) if x ==y => BinOp("*", x, Number(2))
     case - => e
  }
  #+END_SRC
  The guard can be an arbitrary boolean expression. 
- A sealed class cannot have any new subclasses added except the ones
  in the same file. This will help the scala compiler to detect the
  missing cases in a pattern match.

- *Implicit conversion* are governed by the following rules:
  - Only definitions marked implicit are available. 
  - An inserted implicit conversion must be in scope as a single
    identifier, or be associated with the source or target type of the
    conversion.
  - The compiler will also book look implicit definitions in the
    companion object of the source or expected target type of the
    conversion. There is no need to import the conversion separately
    into your
  - Only one implicit is tried at a time, however, the restriction can
    be circumvent by having implicits take implicit parameters. 
