posts/reading/programming-in-scala/index.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Pattern Matching</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Scala's match never "fall through" into the next case. If none of
the patterns match, an exception named "MatchError" is thrown.
</li>
<li>A constant pattern matches only itself. Any literal can be used as a
constant.
</li>
<li>Any <code>val</code> or <b>singleton object</b> can be used as a constant. For
example, <code>Nil</code>, a singleton object, is a pattern that matches only
empty List.
</li>
<li>A <b>variable pattern</b> matches <i>any object</i>, just like a <b>wildcard</b> but
Scala bind the variable to whatever the object is. 
</li>
<li>How does Scala compiler know that "Pi" is a constant imported from
scala.math, and not a variable that stands for the selector value
itself? Scala uses a s impel  lexical rule for disambiguation:
<ul class="org-ul">
<li>a simple name starting with a lowercase letter is taken to be a
pattern variable;
</li>
<li>all other references  are taken to be constants. 
</li>
<li>Lower case  constant identifier  can be treated in pattern match with
a back tick syntax. back tick can also be used to treat a keyword as
an ordinary identifier: <br><code>Tread.`yield`()</code> treats yield as an identifier rather than a
keyword.
</li>
</ul>
</li>
<li>You can match against sequence type like List or Array just like you
match against case classes. you can also match against tuples.
</li>
<li>Typed pattern can be used as a convenient replacement for type tests
and type casts:
<div class="highlight"><pre><span></span>  <span class="k">def</span> <span class="n">generalSize</span><span class="o">(</span><span class="n">x</span><span class="k">:</span> <span class="kt">Any</span><span class="o">)</span> <span class="k">=</span> <span class="n">x</span> <span class="k">match</span> <span class="o">{</span>
     <span class="k">case</span> <span class="n">s</span><span class="k">:</span> <span class="kt">String</span> <span class="o">=&gt;</span> <span class="n">s</span><span class="o">.</span><span class="n">length</span>
     <span class="k">case</span> <span class="n">m</span><span class="k">:</span> <span class="kt">Map</span><span class="o">[</span><span class="k">_</span>, <span class="k">_</span><span class="o">]</span> <span class="k">=&gt;</span> <span class="n">m</span><span class="o">.</span><span class="n">size</span>
     <span class="k">case</span> <span class="k">_</span> <span class="k">=&gt;</span> <span class="o">-</span><span class="mi">1</span>
  <span class="o">}</span>
</pre></div>
</li>
<li>Alternatively: <code>expr.isInstanceOf[String]</code> and
<code>expr.asInstanceOf[String]</code> can be used.
</li>
<li>Scala restricts patterns to be linear: a pattern variable may only
appear once in a pattern. However you can use <b>pattern guard</b>:
<div class="highlight"><pre><span></span>  <span class="k">def</span> <span class="n">simplifyAdd</span><span class="o">(</span><span class="n">e</span><span class="k">:</span> <span class="kt">Expr</span><span class="o">)</span> <span class="k">=</span> <span class="n">e</span> <span class="k">match</span> <span class="o">{</span>
     <span class="k">case</span> <span class="nc">BinOp</span><span class="o">(</span><span class="s">"+"</span><span class="o">,</span> <span class="n">x</span><span class="o">,</span> <span class="n">y</span><span class="o">)</span> <span class="k">if</span> <span class="n">x</span> <span class="o">==</span><span class="n">y</span> <span class="k">=&gt;</span> <span class="nc">BinOp</span><span class="o">(</span><span class="s">"*"</span><span class="o">,</span> <span class="n">x</span><span class="o">,</span> <span class="nc">Number</span><span class="o">(</span><span class="mi">2</span><span class="o">))</span>
     <span class="k">case</span> <span class="o">-</span> <span class="k">=&gt;</span> <span class="n">e</span>
  <span class="o">}</span>
</pre></div>
<p>
The guard can be an arbitrary boolean expression. 
</p>
</li>
<li>A sealed class cannot have any new subclasses added except the ones
in the same file. This will help the scala compiler to detect the
missing cases in a pattern match.
</li>

<li>
<b>Implicit conversion</b> are governed by the following rules:
<ul class="org-ul">
<li>Only definitions marked implicit are available. 
</li>
<li>An inserted implicit conversion must be in scope as a single
identifier, or be associated with the source or target type of the
conversion.
</li>
<li>The compiler will also book look implicit definitions in the
companion object of the source or expected target type of the
conversion. There is no need to import the conversion separately
into your
</li>
<li>Only one implicit is tried at a time, however, the restriction can
be circumvent by having implicits take implicit parameters. 
</li>
</ul>
</li>
</ul>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../../categories/scala/" rel="tag">scala</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../redis-in-action/" rel="prev" title="Redis in Action">Previous post</a>
            </li>
            <li class="next">
                <a href="../play-for-scala/" rel="next" title="Play for Scala">Next post</a>
            </li>
        </ul></nav></aside></article><footer id="footer"><p>Contents © 2017         <a href="mailto:wudong@graceliu.uk">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         </p>
            
        </footer>
</div>
    </div>
    <label for="sidebar-checkbox" class="sidebar-toggle"></label>
    
    
    
            <script src="../../../assets/js/jquery.min.js"></script><script src="../../../assets/js/moment-with-locales.min.js"></script><script src="../../../assets/js/fancydates.js"></script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
